tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-drivers"
tap "michaeleisel/homebrew-zld"

brew "neovim"
brew "gh"
brew "git"
brew "starship"
brew "rustup"
brew "fnm"
brew "pnpm"
brew "python"
brew "ripgrep"
brew "fd"
brew "rust-analyzer"
brew "lazygit"
brew "go"
brew "yarn"
brew "robotsandpencils/made/xcodes"
brew "michaeleisel/zld/zld"
brew "cocoapods"
brew "java"
brew "vercel-cli"
brew "flyctl"
brew "elixir"
brew "protobuf"

cask "rectangle"
cask "discord"
cask "slack"
cask "spotify"
cask "bitwarden"
cask "github"
cask "brave-browser"
cask "warp"
cask "font-fira-code-nerd-font"
cask "logitech-options"
cask "docker"
cask "yubico-yubikey-manager"
cask "linear-linear"
cask "microsoft-outlook"
cask "obs"
cask "blackhole-16ch"
cask "obs-websocket"
cask "chatterino"
cask "flipper"
cask "tableplus"
cask "firecamp"
